# Домашнее задание №1
#Через цикл for посчитать сумму всех чисел, которые вы вводите с клавиатуры самостоятельно (например, от 13 до числа, которое вводите самостоятельно).


# total = 0
# for i in range(13, int(input("Введите число: ")) + 1):
#     if i >= 13:  # проверяем, что число больше 13
#         total += i
# print("Сумма чисел от 13 до введенного числа: ", total)


# Домашнее задание №2 
#Вывести четные числа из диапазона от 0 до числа, которое вы вводите с клавиатуры.
# a=[]
# number = int(input("Введите число: "))
# for i in range(0, number):
#         i+=1
#         if i % 2 == 0:
#             a.append (i)
# print("Четные числа от 0 до", number , a )

# Домашнее задание №3 
# Посчитать сумму всех чисел, что делятся на 3 от 0 до числа которое, вы вводите с клавиатуры.
# total = 0
# for i in range(0, int(input("Введите число: ")) + 1):
#     if i % 3 == 0:  # проверяем, что число больше 13
#         total += i
# print ("Сумма чисел, до 0 до введеноого числа, которые делятся на 3 =" , total)
